// 定数
const quizData = [
    {
        question: "2進数「10011101」を10進数と16進数に変換したものを選択してください",
        a: "10進数:156　16進数:9C",
        b: "10進数:156　16進数:9D",
        c: "10進数:157　16進数:9D",
        d: "10進数:157　16進数:C",
        correct: "c",
    },
    {
        question: "10進数「213」を2進数に変換したものはどれですか。",
        a: "11010101",
        b: "11010010",
        c: "11010100",
        d: "11010110",
        correct: "a",
    },
    {
        question: "レイヤ２でカプセル化されるPDUは次のうちどれか。",
        a: "パケット",
        b: "データグラム",
        c: "セグメント",
        d: "フレーム",
        correct: "d",
    },
    {
        question: "異なるネットワーク上に存在している宛先ホストのアドレスをヘッダ内に格納しているのはOSI参照モデルのどの階層ですか。",
        a: "トランスポート層",
        b: "データリンク層",
        c: "ネットワーク層",
        d: "セッション層",
        correct: "c",
    },
  ];